depot/app/controllers/sofas_controller.rb

  def index
    @sofas = Sofa.all
---
SELECT * FROM "sofas"